[{"createdAt":1640415656071,"content":"<p><strong>Merhaba,</strong></p><p>Bu yazıyı temel insan ihtiyaçlarından olduğunu düşündüğüm bilgiyi aktarma ihtiyacımdan dolayı ve aynı zamanda belki birilerine faydası dokunur diye yazıyorum. Bugün <strong>KOÜ Elektrik Mühendisliği</strong> bölümüne yeni başlamış olan birinci sınıf arkadaşların WhatsApp gruplarına girdiğimde mevcut dönem derslerinden olan <strong>“Bilgisayar Programlamaya Giriş”</strong> hakkında fikir alışverişi yaptıklarını gördüm ve ben de bilgim dahilinde birkaç şey paylaşmak istedim.</p>","cover":"contentrain/static/1640415651309_cover.jpg","title":"Yazılıma başlamayı düşünenler ve henüz başlamışlar için tavsiyeler","ID":"1e5337bc-195f-47b9-b51f-310087ce18b4","tags":[]},{"createdAt":1640415753506,"content":"<p>Redux-saga redux için geliştirilmiş.Redux’ta yan etkileri çözmek için geliştirilmiş bir ara katmanda çalışan react kütüphanesidir.</p><p>React kullanırken bazı durumlarda javascriptin yapısı gereği işlemler eğer zaman alacaksa beklemez ve diğer işlemlere geçer ama bu data eğer kritik öneme sahip ise bir süre beklememiz gerekiyor.Bunun için javascripte metodlar var ama redux kullanırken bunu redux-saga ve redux-thunk gibi kütüphaneler ile reducer’a gelmeden önce halletmemiz gerekiyor.</p>","cover":"","title":"React için Redux-Saga Nedir?","ID":"ccb1e82e-5f2c-4c02-87d5-8c5518ca91d0","tags":[]},{"createdAt":1640415836153,"content":"<p><strong>Hollanda Oturum izni nasıl alınır?</strong></p><p>Hollanda'da 3 ayı aşan bir süre kalmayı veya daimi olarak ülkede yaşamayı amaçlayanlar Hollanda oturum izni MVV için başvuru yapmalıdırlar. <a href=\"https://www.vizemerkezi.com/hollanda/\" rel=\"noopener noreferrer\" target=\"_blank\">Hollanda oturum izni</a> başvurusu Hollanda'dan veya Türkiye'den yapılabilmektedir ancak Hollanda'da yapılacağı durumda, ülkeye davet eden şahıs tarafından başvuru Hollanda makamlarına yapılabilmektedir.</p><p>Hollanda oturum izni eğer yurtdışından başlatılmasına tavsiye işlemi denir. Eğer başvuru Türkiye'deki Hollanda Başkonsolosluğu veya Büyükelçiliği üzerinden yapılırsa başvuru işlemi söz konusu olur. Hollanda'da oturum izni alabilmek için aşağıdaki kriterlerden birine göre oturum izni talebinde bulunabilirsiniz.</p><ul><li>Serbest iş</li><li>Ücretli iş</li><li>Oturum izni olan eş veya partnerin yanında kalma (aile oluşturma amacıyla)</li><li>Aile Birleşimi (ebeveynin yanında reşit olmayan çocuk için oturum (ikamet) veya reşit olan çocuk için ikamet)</li><li>Çocuk yanında ikamet</li><li>Evlatlık olarak ikamet</li><li>Eğitim ve eğitiem hazırlık olarak ikamet</li><li>Stajyer çalışan (ücretli)</li><li>Aile üyelerinin yanında 3 aydan uzun süre kalma</li><li>Aupair olarak çalışma</li><li>Tıbbi tedavi</li></ul><p><br></p>","cover":"","title":"Hollanda Oturum ve Çalışma İzni","ID":"55a56f69-bfb6-493b-8736-4b2eda443134","tags":[]}]