[
  {
    "createdAt": 1645558586525,
    "coverImage": "1645558582640_blog-1.png",
    "tags": [],
    "excerpt": "Web 3 is at boom right now, making projects during a hackathon is a great way to sharpen your skills, learn new technologies, and win rewards.\n\nI've highlighted a few that you might be interested in.",
    "ID": "c28d273d-18c3-4a82-baec-bfd723fcaec0",
    "content": "<h3>Introduction</h3><p>Web 3 is at boom right now, making projects during a hackathon is a great way to sharpen your skills, learn new technologies, and win rewards.</p><p>I've highlighted a few that you might be interested in.</p><p> There's no need to be concerned about your age because the majority of people are of any age.</p><h4><a href=\"https://dev.to/hackanuj/web3-hackathons-you-can-attend-5h8m#1-welcome-to-the-solana-riptide-hackathon\" rel=\"noopener noreferrer\" target=\"_blank\"> </a> 1. Welcome to the Solana Riptide Hackathon</h4><ul><li>Ends: 17 Mar, 2022</li><li>Venue: Online</li><li>Theme: Blockchain</li><li>Total Prize worth: $5 Million + More</li></ul><p><strong>Who can participate:</strong></p><ul><li>Anyone</li><li>All countries</li><li>Team size - 2-4 members</li></ul><p><strong>Register Here:</strong> <a href=\"https://solana.com/riptide\" rel=\"noopener noreferrer\" target=\"_blank\">Link</a></p><h4><a href=\"https://dev.to/hackanuj/web3-hackathons-you-can-attend-5h8m#2-theta-q1-2022-hackathon\" rel=\"noopener noreferrer\" target=\"_blank\"> </a> 2. Theta Q1 2022 Hackathon</h4><ul><li>Ends: 23 Apr, 2022</li><li>Venue: Online</li><li>Theme: AR/VR, Blockchain, Gaming</li><li>Total Prize worth: $500,000</li></ul><p><strong>Who can participate:</strong></p><ul><li>Anyone who is 18+</li><li>All countries</li><li>Team size - 1-4 members</li></ul><p><strong>Register Here:</strong> <a href=\"https://theta-2022-hackathon.devpost.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Link</a></p><h4><a href=\"https://dev.to/hackanuj/web3-hackathons-you-can-attend-5h8m#3-faber-web3-hackathon\" rel=\"noopener noreferrer\" target=\"_blank\"> </a> 3. Faber Web3 Hackathon</h4><ul><li>Ends: 18 Mar, 2022</li><li>Venue: Online</li><li>Theme: Blockchain, Beginner Friendly, Web</li><li>Total Prize worth: €75,000</li></ul><p><strong>Who can participate:</strong></p><ul><li>Anyone who is 18+</li><li>All countries</li><li>Team size - 1-4 members</li></ul><p><strong>Register Here:</strong> <a href=\"https://faberweb3.devpost.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Link</a></p><h4><a href=\"https://dev.to/hackanuj/web3-hackathons-you-can-attend-5h8m#4-arweave-ltgt-polygon-hackathon\" rel=\"noopener noreferrer\" target=\"_blank\"> </a> 4. Arweave &lt;&gt; Polygon Hackathon</h4><ul><li>Ends: 11 Mar, 2022</li><li>Venue: Online</li><li>Theme: Blockchain, Web</li><li>Total Prize worth: $15,000</li></ul><p><strong>Who can participate:</strong></p><ul><li>Anyone</li><li>All countries</li><li>Team size - 1-4 members</li></ul><p><strong>Register Here:</strong> <a href=\"https://arweave-polygon.devpost.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Link</a></p><h4><a href=\"https://dev.to/hackanuj/web3-hackathons-you-can-attend-5h8m#5meter-ethereum-hackathon\" rel=\"noopener noreferrer\" target=\"_blank\"> </a> 5.Meter Ethereum Hackathon</h4><ul><li>Ends: 11 Apr, 2022</li><li>Venue: Online</li><li>Theme: Blockchain</li><li>Total Prize worth: $100,000</li></ul><p><strong>Who can participate:</strong></p><ul><li>Anyone</li><li>All countries</li><li>Team size - 2-4 members</li></ul><p><strong>Register Here:</strong> <a href=\"https://meter-ethereum.devpost.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Link</a></p><h2><a href=\"https://dev.to/hackanuj/web3-hackathons-you-can-attend-5h8m#bonus\" rel=\"noopener noreferrer\" target=\"_blank\"> </a> Bonus</h2><h4><a href=\"https://dev.to/hackanuj/web3-hackathons-you-can-attend-5h8m#1-ypstem-hackathon-2022\" rel=\"noopener noreferrer\" target=\"_blank\"> </a> 1. YPStem Hackathon 2022</h4><ul><li>Ends: 7 Mar, 2022</li><li>Venue: Online</li><li>Theme: Low/No Code, Beginner Friendly, Open Ended</li><li>Total Prize worth: $50,000</li></ul><p><strong>Who can participate:</strong></p><ul><li>Anyone who is 13+</li><li>All countries</li><li>Team size - 1-4 members</li></ul><p><strong>Register Here:</strong> <a href=\"https://ypstemhackathon2022.devpost.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Link</a></p><h4><a href=\"https://dev.to/hackanuj/web3-hackathons-you-can-attend-5h8m#2-microsoft-us-azure-ai-hack-for-humanitarian-action\" rel=\"noopener noreferrer\" target=\"_blank\"> </a> 2. Microsoft US Azure AI: Hack for Humanitarian Action</h4><ul><li>Ends: 28 Mar, 2022</li><li>Venue: Online</li><li>Theme: Health, Lifehacks, Social Good</li><li>Total Prize worth: $10,000</li></ul><p><strong>Who can participate:</strong></p><ul><li>Anyone</li><li>US Only</li><li>Team size - 1-4 members</li></ul><p><strong>Register Here:</strong> <a href=\"https://humanitarianhack.devpost.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Link</a></p><h2><a href=\"https://dev.to/hackanuj/web3-hackathons-you-can-attend-5h8m#points-to-be-noted\" rel=\"noopener noreferrer\" target=\"_blank\"> </a> Points to be noted</h2><ul><li><strong>Open-Ended</strong> means you can build whatever you want and can use any technology you are familiar with, example webdev, AI/ML etc.</li><li>Some hackathons allow <strong>cross submission</strong>, which means you can submit the same project at multiple hackathons.</li><li>Also, be active in the discord/slack of the particular hackathon you are attending as there are various mini-events, raffles etc. are also organized which you can take part in.</li></ul><p>Thank you for reading this, article. I hope you enjoy participating in this amazing hackathons and learn something.</p><p>I would really appreciate you if you would follow me on <a href=\"https://twitter.com/hackanuj\" rel=\"noopener noreferrer\" target=\"_blank\">Twitter</a>.</p>",
    "title": "Web3 Hackathons you can attend ",
    "author": "Mert Düzgün"
  },
  {
    "createdAt": 1645558797283,
    "excerpt": "The Internet of Things plays a key role in digital transformation. However, in many cases, organizations realize that they already have a large fleet of legacy IoT devices that have been gradually deployed over the years. Many of these devices may not have been designed with security in mind.",
    "content": "<p>The Internet of Things plays a key role in digital transformation. However, in many cases, organizations realize that they already have a large fleet of legacy IoT devices that have been gradually deployed over the years. Many of these devices may not have been designed with security in mind.</p><p>One of the biggest concerns of IoT is managing the risks associated with a growing number of IoT devices. <a href=\"https://www.exabeam.com/information-security/information-security/\" rel=\"noopener noreferrer\" target=\"_blank\">Information security</a> and privacy issues related to IoT devices have attracted global attention, because of the ability of these devices to interact with the physical world. IoT vulnerabilities continue to emerge, making it critical for manufacturers to emphasize IoT security by design.</p><p>IoT vulnerabilities have been discovered and exposed across many industries. These vulnerabilities threaten sensitive data as well as personal safety. Without a doubt, the Internet of Things is a prime target for hackers in the 2022, and any organization that produces or uses these devices needs to be prepared.</p><h2><a href=\"https://dev.to/oleksiitsymbal/how-to-mitigate-iot-security-threats-in-2022-5ac0#iot-security-threats\" rel=\"noopener noreferrer\" target=\"_blank\"> </a> IoT Security Threats</h2><p>Below we briefly review some of the common cybersecurity threats facilitated by IoT devices.</p><h3><a href=\"https://dev.to/oleksiitsymbal/how-to-mitigate-iot-security-threats-in-2022-5ac0#iot-botnets\" rel=\"noopener noreferrer\" target=\"_blank\"> </a> IOT BOTNETS</h3><p>IoT devices are attractive targets for botnet builders—these are hackers who compromise millions of devices, connecting them into a network they can use for criminal activities. IoT devices are a good candidate for botnets due to their weak security and the large number of virtually identical devices, which attackers can compromise using the same tactics.</p><p>Attackers can use unprotected ports or phishing scams to infect IoT devices with malware, and enlist them into botnets that can be used to launch large-scale cyber attacks. Hackers can use readily available attack toolkits, able to detect sensitive devices, penetrate them, and avoid detection. Another module in the toolkit then instructs the device to launch an attack or steal information on behalf of the botnet owner.</p><p>Threat actors often leverage IoT botnets during distributed denial of service (DDoS) attacks; see the example attacks section below.</p><h3><a href=\"https://dev.to/oleksiitsymbal/how-to-mitigate-iot-security-threats-in-2022-5ac0#data-exfiltration\" rel=\"noopener noreferrer\" target=\"_blank\"> </a> DATA EXFILTRATION</h3><p>When hackers use malware to infect IoT devices, they can do more than just enlist the device into a botnet. For example, attackers can access the device data and steal any sensitive information stored there. Attackers also leverage IoT to harvest credentials from device firmware. Using these credentials, attackers can gain access to corporate networks or other systems storing sensitive data. In this way, an attack on a seemingly innocent device can turn into a full-scale data breach.</p><h3><a href=\"https://dev.to/oleksiitsymbal/how-to-mitigate-iot-security-threats-in-2022-5ac0#shadow-iot\" rel=\"noopener noreferrer\" target=\"_blank\"> </a> SHADOW IOT</h3><p>Shadow IoT arises because IT administrators do not always have control over devices connected to the network. Devices with IP addresses, such as digital assistants, smart watches, or printers, frequently connect to corporate networks, and do not always meet security standards.</p><p>Without knowledge of shadow IoT devices, IT administrators cannot ensure that hardware and software have basic security features, and find it difficult to monitor malicious traffic on devices. When hackers compromise these devices, they can leverage the connection to the corporate network and escalate privileges to access sensitive information on the corporate network.</p><h2><a href=\"https://dev.to/oleksiitsymbal/how-to-mitigate-iot-security-threats-in-2022-5ac0#notable-iot-security-breaches-and-hacks\" rel=\"noopener noreferrer\" target=\"_blank\"> </a> Notable IoT Security Breaches and Hacks</h2><p>Since the IoT concept was born in the late 1990s, security experts have warned that devices connected to the Internet will pose a risk to society. Since then, numerous large-scale attacks have been publicized, in which attackers compromised IoT devices and created a real threat to public safety and corporate security. Here are a few examples.</p><h3><a href=\"https://dev.to/oleksiitsymbal/how-to-mitigate-iot-security-threats-in-2022-5ac0#stuxnet\" rel=\"noopener noreferrer\" target=\"_blank\"> </a> STUXNET</h3><p>In 2010, researchers discovered that a virus called Stuxnet caused physical damage to nuclear centrifuges in Iran. The attack began in 2006, with the primary stage of the campaign in 2009. The malware manipulated commands sent from programmable logic controllers (PLC). Stuxnet is often considered an IoT attack, amongst the earliest targeting a supervisory control and data acquisition (SCADA) system, used in industrial environments.</p><h3><a href=\"https://dev.to/oleksiitsymbal/how-to-mitigate-iot-security-threats-in-2022-5ac0#first-iot-botnet\" rel=\"noopener noreferrer\" target=\"_blank\"> </a> FIRST IOT BOTNET</h3><p>In 2013, Proofpoint researchers discovered what is now considered “the first IoT botnet”. Over 25% of the botnet was composed of non-computer devices such as smart TVs, home appliances, and baby monitors. Since then malware like CrashOverride, VPNFilter, and Triton, have been used extensively to compromise industrial IoT systems.</p><h3><a href=\"https://dev.to/oleksiitsymbal/how-to-mitigate-iot-security-threats-in-2022-5ac0#compromising-a-jeep\" rel=\"noopener noreferrer\" target=\"_blank\"> </a> COMPROMISING A JEEP</h3><p>In 2015, two security researchers hacked into a Jeep vehicle wirelessly, via the Chrysler Uconnect system deployed in the car, and performed remote actions like changing channels on the radio, turning on the wipers and air conditioner. The researchers said they could disable the breaks, and cause the engine to stall, slow down, or shut down altogether.</p><h3><a href=\"https://dev.to/oleksiitsymbal/how-to-mitigate-iot-security-threats-in-2022-5ac0#mirai-botnet\" rel=\"noopener noreferrer\" target=\"_blank\"> </a> MIRAI BOTNET</h3><p>In 2016 Mirai, one of the largest IoT botnets ever discovered, began its activity by attacking the websites of security researcher Brian Krebs and a European hosting company, OVH. The attacks were of a huge magnitude—630 Gbps and 1.1 Tbps. Afterwards, the botnet was used to attack Dyn, a large DNS provider, and high profile websites including Twitter, Amazon, Netflix, and the New York Times. The attackers built their network from IoT devices like routers and IP surveillance cameras.</p><h3><a href=\"https://dev.to/oleksiitsymbal/how-to-mitigate-iot-security-threats-in-2022-5ac0#st-jude-cardiac-device-vulnerability\" rel=\"noopener noreferrer\" target=\"_blank\"> </a> ST. JUDE CARDIAC DEVICE VULNERABILITY</h3><p>In 2017, the Food and Drug Administration (FDA) announced that implantable cardiac devices manufactured by St. Jude Medical, including pacemakers implanted in living patients, were vulnerable to attack. Billy Rios and Jonathan Butts, security researchers presenting at the Black Hat Conference, proved their ability to hack into a pacemaker and shut it down, which if it were done by hackers, would kill the patient.</p><h2><a href=\"https://dev.to/oleksiitsymbal/how-to-mitigate-iot-security-threats-in-2022-5ac0#iot-security-best-practices\" rel=\"noopener noreferrer\" target=\"_blank\"> </a> IoT Security Best Practices</h2><p>As you start to consider an IoT security strategy for your organization, here are a few best practices that can improve your security posture.</p><h3><a href=\"https://dev.to/oleksiitsymbal/how-to-mitigate-iot-security-threats-in-2022-5ac0#use-iot-security-analytics\" rel=\"noopener noreferrer\" target=\"_blank\"> </a> USE IOT SECURITY ANALYTICS</h3><p>A security analytics infrastructure can significantly reduce vulnerabilities and security issues related to the Internet of Things. This requires collecting, compiling, and analyzing data from multiple IoT sources, combining it with threat intelligence, and sending it to the <a href=\"https://www.exabeam.com/security-operations-center/security-operations-center-a-quick-start-guide/\" rel=\"noopener noreferrer\" target=\"_blank\">security operations center</a>(SOC).</p><p>When <a href=\"https://mobidev.biz/blog/what-is-iot-data-analytics-how-to-implement-it-in-your-organization\" rel=\"noopener noreferrer\" target=\"_blank\">IoT data</a> is combined with data from other security systems, security teams have a much better chance of identifying and responding to potential threats. Security analytics systems can correlate data sources and identify anomalies that might represent suspicious behavior. Security teams can then investigate and respond to anomalies, preventing attackers from compromising corporate IoT devices.</p><h3><a href=\"https://dev.to/oleksiitsymbal/how-to-mitigate-iot-security-threats-in-2022-5ac0#network-segmentation\" rel=\"noopener noreferrer\" target=\"_blank\"> </a> NETWORK SEGMENTATION</h3><p>Network segmentation is a technique that enables isolation of specific components from others, to improve security. In the case of IoT, segmentation can help prevent attackers or <a href=\"https://www.exabeam.com/ueba/insider-threats/\" rel=\"noopener noreferrer\" target=\"_blank\">malicious insiders</a> from connecting to IoT devices, or can prevent compromised devices from infecting other parts of the network. You can implement this technique into your strategies or use a <a href=\"https://www.esecurityplanet.com/products/best-network-security-tools/\" rel=\"noopener noreferrer\" target=\"_blank\">network security solution</a>.</p><p>To begin a segmentation effort, create a comprehensive list of IoT devices currently in use, their connection methods (VLAN or LAN), how and what type of data they transmit, and which other devices on the network each device really needs to connect to. In particular, check if each category of device needs to have access to the Internet, and if not, disable it.</p><p>One suggestion for segmentation is to designate specific categories of devices, such as data collection, infrastructure, or personal employee-owned devices. You can create a segmentation strategy based on the connectivity requirements of each IoT endpoint, and act to isolate or block network access to endpoints that don’t really need it.</p><h3><a href=\"https://dev.to/oleksiitsymbal/how-to-mitigate-iot-security-threats-in-2022-5ac0#enable-device-authentication\" rel=\"noopener noreferrer\" target=\"_blank\"> </a> ENABLE DEVICE AUTHENTICATION</h3><p>Another way to reduce the vulnerability of IoT devices to attacks by enforcing full authentication on all devices. Whether your IoT devices have simple password authentication, or more advanced measures like digital certificates, biometric, or multi factor authentication (MFA), use the most secure authentication available on the device and ensure you never use the factory default password.</p><h3><a href=\"https://dev.to/oleksiitsymbal/how-to-mitigate-iot-security-threats-in-2022-5ac0#ai-and-ml-for-iot-security\" rel=\"noopener noreferrer\" target=\"_blank\"> </a> AI AND ML FOR IOT SECURITY</h3><p>An expanding network of IoT devices produces tremendous amounts of data, which are useless without proper analysis. Massive sets of data are analyzed with the help of <a href=\"https://mobidev.biz/services/machine-learning-consulting\" rel=\"noopener noreferrer\" target=\"_blank\">Artificial intelligence</a> (AI) and machine learning, allowing machines to teach themselves, retain what they learnt, and hence improve the capabilities of IoT systems.</p><p>Being the one of the recent <a href=\"https://mobidev.biz/blog/iot-technology-trends\" rel=\"noopener noreferrer\" target=\"_blank\">IoT trends</a>, AI-based Intrusion Detection Systems (IDS) continuously monitor the network, collecting and analyzing information from previous attacks. They can predict an attack based on the historical data and suggest a solution to fight the threat. Even new hacking techniques are made up, they still may include previously used patterns, which can be recognized with ML algorithms in real-time.</p><p>In general, there are two types of ML-based IDS.</p><p><strong>Anomaly IDS</strong> detects attacks based on recorded normal behavior, comparing the current real time traffics with previous recorded normal real time traffics. These systems are capable of detecting a new type of attack, so widely used even in spite of a large amount of false positive alarms.</p><p><strong>Misuse or signature IDS</strong> compares the similarity between the patterns recognized in the current real time traffics and the already known patterns of various types of previous attacks. It shows a smaller amount of false positive alarms, but at the same time, the new type of attack can pass-through undetected.</p><p>ML algorithms like Linear Discriminant Analysis (LDA), Classification and Regression Trees (CART) and Random Forest can be used for attacks identification and classification.</p><p>MobiDev offers innovative <a href=\"https://mobidev.biz/services/iot-development\" rel=\"noopener noreferrer\" target=\"_blank\">IoT development services</a> to ensure IoT ecosystem security, using artificial intelligence and machine learning to combat and mitigate IoT cyber threats.</p>",
    "ID": "62b3bd21-6cd8-488f-880e-4b03c1de4a24",
    "author": "Sercan Oray",
    "title": "How to Mitigate IoT Security Threats in 2022 ",
    "tags": [],
    "coverImage": "1645558794791_blog-2.png"
  }
]